Repository: AigizK/bashkort-parallel-corpora
Catalog: tmx/Курултай8.tmx
Source language: ba
Languages: ru

source: 1922 йылдың 15 октябрендә Башҡортостандың Йылайыр районы, хәҙерге Ейәнсура районы Байдәүләт ауылында тыуа.
ru: Родился 15 октября 1922 г. в деревне Байдавлетово Зилаирского района БАССР, ныне Зианчуринского района Республики Башкортостан.

source: Бөйөк Ватан һуғышында ҡатнаша.
ru: Участник Великой Отечественной войны.

source: К.А. Тимирязев исемендәге Башҡорт дәүләт педагогия инситутын (1956), КПСС Үҙәк комитеты ҡарамағындағы Ижтимағи фәндәр академияһын (1962) тамамлай.
ru: Окончил Башкирский государственный педагогический институт им. К. А. Тимирязева (1956), Академию общественных наук при ЦК КПСС (1962).

source: 1939-1946 йылдарҙа бер-нисә тапҡыр Ейәнсура районы мәктәптәрендә уҡытыусы булып эшләй.
ru: В 1939-1946 гг. с перерывами работал учителем в школах Зианчуринского района.

source: 1946-1958 йылдарҙа партия һәм комсомол эшмәкәрлеге менән мәшғүл була.
ru: В 1946-1958 гг. - на комсомольской и партийной работе.

source: 1962 йылдан алып Бөрө дәүләт педагогия институты ректоры вазифаһын атҡара.
ru: С 1962 г. – ректор Бирского государственного педагогического института.

source: 1963 йылдан алып КПСС-тың Башҡортостан өлкә комитеты секретары булып эшләй.
ru: С 1963 г. – секретарь Башкирского обкома КПСС.

source: 1967-1990 йылдарҙа – БАССР Юғары Советы Президиумы Рәйесе.
ru: В 1967-1990 гг. – Председатель Президиума Верховного Совета БАССР.

source: Хеҙмәт Ҡыҙыл Байраҡ (1971, 1976), 1-се дәрәжә Ватан һуғышы (1988), Ҡыҙыл Йондоҙ (1966), Халыҡтар дуҫлығы (1982), «Почет билдәһе» (1966) ордендары менән бүләкләнә.
ru: Награжден орденами Трудового Красного Знамени (1971, 1976), Отечественной войны 1-й степени (1988), Красной Звезды (1966), Дружбы народов (1982), «Знак Почета» (1966).
